Revit 2025 API
ElectricalLoadType Enumeration
 Represents the electrical load type.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum ElectricalLoadType
Public Enumeration ElectricalLoadType
public enum class ElectricalLoadType
type ElectricalLoadType
Members
Member name | Value | Description
EquipmentLoad | 0 |  Equipment Load
AreaBasedLoad | 1 |  Area Based Load
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace